In [3]:
from pandas import DataFrame, Series
import pandas as pd
import numpy as np

data_frame = DataFrame({
    'name': ['John', 'John', 'Edward', 'Smith', 'Edward', 'John'],
    'age': [19, 19, 20, 21, 20, 19]
})

data_frame

   age    name
0   19    John
1   19    John
2   20  Edward
3   21   Smith
4   20  Edward
5   19    John

In [4]:
# 检测是否存在重复行
data_frame.duplicated()

0    False
1     True
2    False
3    False
4     True
5     True
dtype: bool

In [5]:
# 删除重复行
data_frame.drop_duplicates()

   age    name
0   19    John
2   20  Edward
3   21   Smith